Repository: 84000/data-translation-memory
Catalog: toh62-v3.tmx
Source language: bo
Languages: en

source: །བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་སྔོན་སྤྱད་ཚེ། །སེམས་ཅན་ཕན་ཕྱིར་བྱང་ཆུབ་མཆོག་དོན་དུ།
en: “In the past, for an inconceivable number of eons,

source: །སྦྱིན་དང་དུལ་དང་དེས་ལ་རྟག་ཏུ་སྤྱད།
en: I always practiced generosity, discipline, and observances, In order to achieve the highest enlightenment for the sake of living beings.

source: །གཉེན་པ་སྤངས་ནས་བདེ་བར་གནས་པར་གྱུར།
en: Having abandoned my kinsmen, I lived happily.

source: །བས་མཐའ་ནགས་སུ་རྟག་པར་ང་དགའ་སྟེ།
en: “I was always joyful in remote forests;

source: །བྱང་ཆུབ་ཆེད་དུ་བསམ་པ་རྣམ་པར་སྦྱངས།
en: I fully purified my intent for the sake of enlightenment.

source: །བརྒྱ་ལམ་ན་ཡང་བརྩོན་འགྲུས་ཉམས་མ་གྱུར།
en: My diligence never waned, even occasionally,

source: །སྐྱེས་ཆེན་རྣམས་ཀྱི་ཡེ་ཤེས་དེ་འདྲའོ།
en: As I sought the wisdom of great beings. “Once I beheld sentient beings, who are forced to wander

source: །སྲིད་པའི་བརྩོན་རར་འགྲོ་བ་ལྔ་འཁྱམས་པས། །སེམས་ཅན་འཁྱམ་པའི་འགྲོ་བ་མཐོང་ནས་ནི།
en: In the five realms, this prison of existence,

source: །སྔོན་ཆད་འདིར་ནི་སྙིང་རྗེ་རྒྱ་ཆེན་བསྐྱེད།
en: In that very moment I generated vast compassion

source: །འགྲོ་བའི་དོན་དུ་བྱང་ཆུབ་དམ་པ་བསྒྲུབས།
en: And accomplished excellent enlightenment for the sake of the world.

source: །བསྐལ་པ་མང་པོར་བྱང་ཆུབ་མཆོག་ཚོལ་ཞིང་།
en: “I sought supreme enlightenment for many eons And gave up many things:

source: །རང་གི་བུ་ཕོ་བུ་མོ་ཆུང་མ་སྡུག །ཕངས་པའི་སྲོག་དང་ཤིན་ཏུ་འབྱོར་ས་དང་། །གྲོང་ཁྱེར་ནོར་དང་འབྲུ་རྣམས་མང་པོ་བཏང་།
en: my beloved sons, daughters, and wives, My precious life, and exceedingly abundant lands, Cities, riches, and crops. “I, the Sage, delighted in patience

source: །མེ་ཏོག་འབྲས་བུ་ཆུ་འབྱོར་ཉམས་དགའ་བའི། །ནགས་སུ་ཐུབ་པ་ང་ནི་བཟོད་དགར་གྱུར།
en: In pleasant forests abundant with flowers, fruits, and water.

source: །ཀ་ལིང་རྒྱལ་པོས་ལག་པ་རྐང་པ་བཅད།
en: Even when King Kali cut off my hands and legs,

source: །དེ་ཚེ་ང་ནི་ལྡང་བའི་ཡིད་མ་གྱུར།
en: My mind did not turn to anger. “Even when the king pierced me with a sturdy arrow,

source: །ནགས་དང་སུལ་ན་སྔོ་བསངས་ཞེས་བྱ་བའི།
en: When I was the sage called Śyāmaka, living in woods and caves,

source: །ཐུབ་པས་བླ་མ་རྒས་པ་གསོ་བ་ན། །མི་ཡི་དབང་པོས་སྲ་བའི་མདས་བསྣུན་ཀྱང་།
en: Looking after my old guru,

source: །ཡིད་ནི་ཡོངས་སུ་གནོད་པར་སེམས་མ་གྱུར།
en: My mind did not generate harmful thoughts.

source: །ལེགས་པར་གསུངས་པའི་ཆེད་དུ་གཡང་ས་ནས།
en: “For the sake of excellent teachings, I jumped off a cliff

source: །ལུས་ལ་མ་བལྟས་རབ་ཏུ་མཆོངས་པར་གྱུར།
en: Without being concerned for my body.

source: །ངས་ནི་བྱང་ཆུབ་མཆོག་གི་རྒྱུ་ཡི་ཕྱིར།
en: For the sake of the causes for supreme enlightenment,

source: །ལུས་དང་སྲོག་ལ་བལྟས་པར་མ་གྱུར་ཏོ།
en: I disregarded body and life.

source: །སྟག་མོ་བུ་དང་བཅས་པའི་སྲོག་གི་ཕྱིར།
en: “For the sake of the lives of a tigress and her cubs,

source: །ལུས་བཏང་ནས་ནི་སྟག་མོ་ཚིམ་པར་བྱས།
en: I satiated the tigress by sacrificing my body.

source: །ནམ་མཁའ་ལས་ནི་ལྷ་ཡི་ཚོགས་རྣམས་ཀྱི།
en: From the heavens, hosts of gods proclaimed,

source: །སྐྱེས་ཆེན་བརྩོན་འགྲུས་བརྟེན་པ་ལེགས་ཤེས་བསྒྲགས།
en: ‘Excellent, great being with firm effort!’

source: །གང་ཚེ་སྔོན་ཆད་སྲིད་པར་སྤྱོད་པ་ན།
en: “When wandering through former existences, I was

source: །སྦྱིན་ལ་རབ་དགའ་བྲམ་ཟེ་ཁྱེའུར་གྱུར་ཚེ།
en: A young brahmin who took great delight in generosity;

source: །རིན་ཆེན་ཆེད་དུ་རྒྱ་མཚོ་བསྐམས་ནས་ནི།
en: I dried up an ocean for the sake of jewels,

source: །ནོར་བུ་རྙེད་ནས་སེམས་ཅན་བདེ་བར་བྱས།
en: And obtained the jewels, with which I delighted sentient beings. “At the time when I was

source: །རྒྱལ་པོ་ཟླ་བའི་བུ་ཞེས་བྱར་གྱུར་ཏེ། །རྗོད་པ་གྲགས་ཤིང་ང་ནི་སྤྱོད་པའི་ཚེ།
en: The widely renowned King Sutasoma,

source: །ང་ཡིས་བདེན་པའི་ཚུལ་གྱིས་རྒྱལ་པོ་བརྒྱ། །བསད་པར་བྱས་པ་མྱུར་དུ་ཐར་བར་བྱས།
en: I quickly freed a hundred kings who were about to be killed, Through a truthful deed.

source: །དབུལ་ཞིང་སྡུག་བསྔལ་བ་ཡི་མི་མཐོང་ནས།
en: “Having seen a man who was poor and suffering,

source: །ང་ཡིས་ཕངས་པའི་ལུས་ནི་བཏང་བྱས་ཏེ།
en: I gave away my dear body to him.

source: །ང་ཡིས་ནོར་རྙེད་དེ་ནི་ཕྱུག་པོར་བྱས།
en: Thus, he gained wealth; he was made rich by me.

source: །དེ་ཚེ་ང་ནི་ཀུན་སྦྱིན་རྒྱལ་པོར་གྱུར།
en: At that time, I was King Sarvadada.

source: །ང་འདིར་མི་ཡི་རྒྱལ་པོར་གྱུར་པའི་ཚེ།
en: “When I was that king,

source: །སྐྱབས་སུ་འོངས་པའི་ཕུག་རོན་མཐོང་ནས་ནི།
en: Having seen a pigeon coming for refuge,

source: །རང་གི་ལུས་ལས་ཤ་ཡང་བཅད་བྱས་ཏེ། །རང་ལུས་ངས་བཏང་འཇིགས་པས་ཕོངས་མ་བཏང་།
en: I even cut flesh from my own body. I gave away my own body; I gave it fearlessly.

source: །རྒྱལ་པོ་རལ་པ་ཅན་ཞེས་སྔོན་གྱུར་ཚེ།
en: “Formerly, when I was King Kesarin, Even though all sorts of unequaled medicines were produced

source: །སྨན་པ་མཆོག་གིས་ང་ཡི་ཆེད་དུ་ནི། །མཚུངས་མེད་སྨན་རྣམས་མ་ལུས་སྦྱར་བ་ཡང་།
en: By the best physicians for me,

source: །སྲོག་བཏང་ནས་ནི་དེ་དག་གཞན་ལ་བྱིན།
en: Sacrificing my own life, I handed them over to others.

source: །འགྲོ་བའི་དོན་ཕྱིར་སྔོན་ཆད་སྤྱོད་པ་ན།
en: “When formerly practicing for the sake of the world,

source: །རྒྱལ་བུ་མཆེ་བ་བཟང་ཞེས་བྱ་གྱུར་ཚེ།
en: At the time when I was prince Sudaṃṣṭra,

source: །ཆུང་མ་མ་དྲི་ཁྱོ་ལས་མི་འཕྱོ་བ།
en: I abandoned my loyal wife Madri,

source: །བུར་བཅས་བུ་མོ་མ་ཆགས་མ་བལྟས་བཏང་།
en: As well as my son and daughter, being unattached and unconcerned.

source: །གང་ཚེ་བརྩོན་འགྲུས་འབར་ཞེས་བྱར་གྱུར་ཚེ།
en: “Formerly, when I was Uttaptavīrya,

source: །ང་སྔོན་ལོ་ནི་སྟོང་དུ་ཚད་བར་ཡང་། །བྱ་དཀའ་བརྒྱད་ཅུ་རྩ་བཞི་བཟོད་པར་བྱས།
en: I endured eighty-four thousand years Of hardship,

source: །ནོར་དང་དཔལ་ཡང་སྔན་ཆད་ངས་བཏང་ངོ་།
en: And I renounced wealth and glory in the past.

source: །རྒྱལ་བུ་གཟི་བརྗིད་དྲི་མ་མེད་གྱུར་ཚེ།
en: “When I was prince Vimalatejas,

source: །ང་ཡིས་རྒྱལ་བའི་རིང་བསྲེལ་མཆོད་རྟེན་མདུན། །མཆོག་ཏུ་གུས་པས་ལུས་ལ་མེ་བཏང་སྟེ།
en: Setting fire to my body with supreme devotion Before a stūpa containing the relics of the Victorious One,

source: །སྟོབས་བཅུ་མངའ་བ་རྣམས་ལ་མཆོད་པ་བྱས།
en: I offered it to those who possess the ten strengths.

source: །ང་ནི་རྒྱལ་པོ་ཟླ་འོད་གྱུར་པའི་ཚེ།
en: “When I was King Candraprabha,

source: །མི་བཟད་མིག་ཅན་ཁྲོས་པར་གྱུར་ནས་ནི།
en: Raudrākṣa became enraged;

source: །དེ་ཡིས་ང་ཡི་མགོ་བོ་བསླངས་པ་ན།
en: And as he demanded my head,

source: །དེ་ཚེ་ང་ཡིས་མགོ་བོ་བཅད་དེ་བྱིན།
en: I cut it off and offered it to him.

source: །ང་ནི་བསོད་ནམས་མཉམ་ཞེས་བྱར་གྱུར་ཚེ།
en: “When I was Puṇyasama, I supplied for the benefit of living beings

source: །གྲོང་དང་གྲོང་ཁྱེར་དག་དང་ལམ་སྲང་སྒོ། །ཐམས་ཅད་དུ་ཡང་རྒྱ་ཆེ་སྨན་གྱི་རྣམས།
en: Copious quantities of various kinds of medicine At all the arched gates on streets leading into villages and cities.

source: །དེ་དག་སེམས་ཅན་དོན་ཕྱིར་ངས་བཞག་གོ །སྲིད་པ་རྣམས་ལ་སྤྱོད་པ་གང་གི་ཚེ།
en: “While practicing in former existences,

source: །ང་སྔོན་རྒྱལ་པོ་དགེ་བར་གྱུར་པ་ན།
en: At the time when I was King Śubha,

source: །བུད་མེད་གཟུགས་བཟང་གསེར་དང་མུ་ཏིག་གིས། །ལུས་བརྒྱན་སྟོང་དག་ངས་ནི་བཏང་བ་བྱས།
en: I turned away from thousands of beautiful women, Whose bodies were adorned with gold and pearls.

source: །གང་ཚེ་ང་སྔོན་མི་ཡི་རྒྱལ་པོ་ནི།
en: “Formerly, when I was King Ratnacūḍa,

source: །རིན་ཆེན་གཙུག་ཕུད་གྱུར་ཚེ་མེ་ཏོག་དང་། །སྤོས་མཆོག་རྣམས་དང་གསེར་གྱིས་བརྒྱན་པ་ཡི། །ཅོད་པན་དཔལ་ལྡན་དམ་པ་ངས་བཏང་ངོ་།
en: I gave away my most glorious crown, Adorned with flowers, gold, and supreme incenses.

source: །ང་སྔོན་རྒྱལ་པོ་མོས་ལྡན་གྱུར་པའི་ཚེ།
en: “Formerly, when I was King Dhṛtimān,

source: །ཤིང་བལ་འདའ་བ་འཇམ་པ་ལྟ་བུ་དང་། །པད་མའི་འདབ་མཉེན་ལྟ་བུར་འཇམ་གཞོན་པའི། །ལག་པ་རྐང་པ་དག་ཀྱང་ངས་བཏང་ངོ་།
en: I even gave away my hands and feet, Which were smooth and tender like soft cotton, And like slender lotus petals.

source: །དེད་དཔོན་སེང་གེ་འཛིན་དུ་གྱུར་པ་ན།
en: “When I was the captain Siṃhala,

source: །སྙིང་རྗེ་མེད་ཅིང་མི་བཟད་རབ་གཏུམ་པའི།
en: I completely subjugated hundreds of merciless,

source: །སྲིན་མོ་བརྒྱ་དག་ཤིན་ཏུ་ཚར་བཅད་ནས།
en: Extremely frightful, and fierce demonesses,

source: །རྒྱ་ཤུག་གླིང་དུ་མི་རྣམས་བཀོད་པར་གྱུར།
en: And thus appeased the people on Badara Island.

source: །གང་ཚེ་མིག་བཟངས་ཞེས་བྱར་གྱུར་པ་ན།
en: “When I was Sunetra,

source: །བྱིས་པ་འདོད་དང་ལྡན་ཞིང་ཡིད་རྨོངས་པ། །སྲིན་མོ་དག་ལ་ན་ཆུང་འདུ་ཤེས་པ། །ཚོང་པ་ལྔ་བརྒྱ་དེ་དག་ཐར་བར་བྱས།
en: I liberated five hundred childish and lustful traders Whose obscured minds Perceived demonesses as young ladies.

source: །གང་ཚེ་བསོད་ནམས་འོད་ཟེར་གྱུར་པ་ན། །ལྷ་ཡི་བུ་མོ་ལྟ་བུའི་གཟུགས་ལྡན་པའི།
en: “When I was Puṇyaraśmi,

source: །བུད་མེད་བྱེ་བ་ཕྲག་བཞི་སྤངས་ནས་སུ།
en: I abandoned forty million ladies, With figures like apsarases,

source: །རྒྱལ་བའི་བསྟན་པ་ལ་ནི་རབ་ཏུ་བྱུང་།
en: And became a renunciate for the sake of the Victorious One’s teaching.

source: །སེམས་ཅན་དོན་ཕྱིར་ང་ནི་སྤྱོད་པ་ན། །དྲི་མེད་དག་པའི་གསེར་གྱི་མདོག་ཅན་གྱི།
en: “When I practiced for the benefit of sentient beings

source: །རྒྱལ་པོར་གང་ཚེ་ང་ནི་གྱུར་པ་ན།
en: As King Kāñcanavarṇa, I gave away my great

source: །སོར་མོ་དྲ་བས་འབྲེལ་བ་རྒྱ་ཆེན་བཏང་།
en: Webbed fingers.

source: །རྒྱལ་པོ་ཨུད་པལ་མིག་ཅེས་བྱར་གྱུར་ཚེ།
en: “When I was King Utpalanetra,

source: །པད་མ་སྔོན་པོ་བཟང་པོའི་མདོག་འདྲའི་མིག །ཡིད་དུ་འོང་ཞིང་སྙིང་དུ་སྡུག་གྱུར་པ།
en: I gave away my eyes, colored like beautiful blue lotuses, Charming and delightful,

source: །འགྲོ་བའི་དོན་དུ་ང་ཡིས་བཏང་བ་བྱས།
en: For the sake of the world.

source: །སྨན་པའི་རྒྱལ་པོ་སྐྲ་འདྲར་གྱུར་པའི་ཚེ།
en: “When I was Keśava, king among physicians,

source: །སྡུག་དང་བྲལ་བས་ཉེན་པ་མཐོང་ནས་ནི།
en: Seeing a woman whose beauty and intelligence had vanished,

source: །བུད་མེད་ཆ་བྱད་གཟུགས་ལ་བློ་ཉམས་པ།
en: Afflicted by the separation from her husband,

source: །ངས་ནི་སྙིང་རྗེས་ཡོངས་སུ་ཐར་བར་བྱས།
en: I liberated her out of compassion.

source: །སྔོན་གྱི་སྲིད་པར་ཀུན་མཐོང་གྱུར་པ་ནི།
en: “When I was Sarvadarśin in a former existence,

source: །ནད་ཀྱིས་བཏབ་པའི་ནད་པའི་མི་མཐོང་ནས།
en: Seeing an ill man stricken by disease,

source: །ང་ཡིས་རང་གི་ཁྲག་ཀྱང་བྱིན་གྱུར་ཏེ། །མི་དེ་ངས་ནི་ནད་དང་བྲལ་བར་བྱས།
en: I even gave my own blood, And freed that man from sickness.

source: །རྒྱལ་པོ་མེ་ཏོག་བཟང་ཞེས་བྱར་གྱུར་ཚེ།
en: “When I was the king called Kusuma,

source: །ང་ཡིས་ལུས་ལས་རུས་པ་ཕྱུང་ནས་ནི།
en: I removed a bone from my body

source: །ནད་ཀྱིས་རིང་པར་གྱུར་ལ་རྐང་བྱིན་ཏེ།
en: And gave the marrow to someone emaciated by disease.

source: །ངས་ནི་ནམ་ཡང་སེམས་ཅན་མ་བཏང་ངོ་།
en: I never forsake sentient beings.

source: །རྒྱལ་པོ་དོན་གྲུབ་ཅེས་བྱར་སྔོན་གྱུར་ཚེ།
en: “When I was King Arthasiddhi,

source: །རང་གི་མཛོད་རྣམས་ཐམས་ཅད་ངས་བཏང་ཞིང་།
en: I gave away my whole treasury,

source: །ཕངས་ཤིང་ཡིད་དུ་འོང་བའི་སྲོག་བཏང་སྟེ།
en: And abandoned my agreeable and pleasant life.

source: །ཕོངས་པར་གྱུར་པའི་མི་ནི་ཐར་བར་བྱས།
en: I liberated an impoverished man.

source: །རྒྱལ་པོ་ཕྱོགས་ཀྱི་ཏོག་དུ་གྱུར་པའི་ཚེ།
en: “When I was King Āśuketu,

source: །བྱང་ཆུབ་འདོད་ནས་འགྲོ་བའི་དོན་གྱི་ཕྱིར།
en: Longing for enlightenment for the benefit of the world,

source: །འཁོར་ལོའི་མཚན་ཅན་པད་མ་ལྟ་བུ་ཡི།
en: I gave away both lotus-like hands,

source: །ལག་པ་ཕྲུགས་ཀྱང་མ་བལྟས་རབ་ཏུ་བྱིན།
en: Marked with wheels, without being concerned.

source: །རྒྱལ་པོ་ཐམས་ཅད་མཐོང་དུ་གྱུར་པའི་ཚེ།
en: “When I was King Sarvadarśin,

source: །སྙིང་རྗེ་ལྡན་ཞིང་འགྲོ་དོན་ཕན་འདོད་དོ།
en: I was compassionate and wished to benefit sentient beings.

source: །སྐྱེས་པ་བུད་མེད་དག་གིས་རྒྱས་པ་ཡི། །གླིང་བཞི་པ་ཡང་ངས་ནི་བཏང་བ་བྱས།
en: I relinquished even the four continents, Which were crowded with men and women.

source: །རྒྱལ་པོའི་བུ་མོ་ཡེ་ཤེས་ལྡན་གྱུར་ཚེ།
en: “When I was princess Jñānavatī,

source: །འཇམ་ཞིང་མཉེན་ལ་དྲི་མེད་དཀར་བའི་བརླ།
en: I cut off my soft, tender, stainless-white thigh

source: །དགའ་ཞིང་མགུ་བའི་ཡིད་ཀྱིས་བཅད་ནས་ནི། །རང་གི་ཤ་དང་ཁྲག་ཀྱང་ངས་བྱིན་ནོ།
en: With a delighted and joyful mind. I gave my own flesh and blood.

source: །བུད་མེད་གཟུགས་ལྡན་ཞེས་ནི་བྱར་གྱུར་ཚེ།
en: “When I was lady Rūpyāvatī,

source: །བུད་མེད་བཀྲེས་སྐོམ་ཉམ་ཐག་ངས་མཐོང་ནས།
en: Having seen a woman tormented by hunger and thirst, I gave away both my lovely,

source: །གསེར་ལྟར་སེར་ཞིང་ཤིན་ཏུ་གཞོན་པ་ཡི། །ནུ་མ་སྙིང་དུ་སྡུག་པ་གཉི་ག་བཏང་།
en: Golden breasts, well rounded and very youthful.

source: །རྒྱལ་པོ་དཔལ་གྲགས་ཞེས་བྱར་གྱུར་པ་ན།
en: “When I was King Viśrutaśrī, I abandoned many things that are difficult to abandon:

source: །ཤིན་ཏུ་ཉམས་དགའ་བ་ཡི་རྒྱན་མཆོག་དང་། །རིན་ཆེན་དུ་མ་གོས་དང་ཤིང་རྟ་བཞོན། །གཏང་བར་དཀའ་བ་རྣམ་པ་དུ་མ་གཏང་།
en: Exceedingly delightful ornaments, Copious jewels, clothes, and chariots.

source: །རྒྱལ་བུ་བྱས་པ་གཟོ་བར་གྱུར་པའི་ཚེ།
en: “When I was prince Kṛtajña,

source: །རྒྱ་མཚོ་ལས་ནི་བྱས་པ་མི་གཟོ་བསྒྲལ།
en: I rescued an ungrateful man from the ocean.

source: །རིན་ཆེན་ཕྱིར་ནི་དེ་ཡིས་ང་མིག་ཕྱུང་།
en: He took my eyes to steal my jewels;

source: །འོན་ཀྱང་ང་ལ་ཁྲོས་པའི་སེམས་མེད་དོ།
en: Yet I was not angry.

source: །སྲོག་ཆགས་གོ་དྷར་སྔོན་སྲིད་གྱུར་པའི་ཚེ།
en: “When, in a former existence, I was a lizard who desires ants,

source: །སྲོག་སྦུར་དག་ནི་འཆི་བར་འགྱུར་དོགས་ནས།
en: Being apprehensive about killing ants,

source: །ལུས་ཀྱི་དམ་པ་མ་བལྟས་བཏང་བ་བྱས།
en: I was not concerned about my excellent body and sacrificed it.

source: །དེ་ཚེ་ང་ཡི་སེམས་ནི་གཡོ་བ་མེད།
en: At that time my mind was unwavering.

source: །སྤྱད་པ་སྤྱོད་ཚེ་བྱ་སྲེག་གྱུར་པ་ན།
en: “When I was leading a life as a partridge,

source: །རྒན་ལ་བསྙེན་བཀུར་བྱ་བར་རྟག་དགའ་སྟེ།
en: I always rejoiced in serving elderly people,

source: །ང་ནི་རིམ་གྲོ་གུས་ལ་རབ་ཏུ་དགའ།
en: And I greatly rejoiced in offering service and showing respect.

source: །ང་རྒྱལ་ལྡན་པ་མ་ཡིན་ཁེངས་པ་མེད།
en: I harbored no pride or arrogance.

source: །སྐྱབས་སུ་འོངས་པའི་དོན་ཕྱིར་ང་ཡིས་ནི།
en: “For the sake of someone who had come for refuge,

source: །སྙིང་རྗེ་བསྐྱེད་པ་བྱས་ནས་ལུས་བཏང་སྟེ།
en: Cultivating compassion, I sacrificed my body.

source: །གདོལ་བའི་མི་ཡིས་མདའ་རྣམས་བསྣུན་ཀྱང་ནི། །སྤྲེའུར་གྱུར་ངས་ནི་མི་དེ་མ་བཏང་ངོ་།
en: Even though, as a monkey, a hunter had pierced me with arrows, I did not abandon that man.

source: །རྒྱལ་པོ་དབང་དུ་གྱུར་ཚེ་ང་ཡིས་ནི།
en: “When I was under the king’s power,

source: །གླང་པོ་བླ་མ་རྒན་དྲན་ལུས་བསྐམས་ཏེ།
en: I was mindful of my elderly elephant mother.

source: །ཤིན་ཏུ་ཡིད་འོང་ཟས་ཀྱང་ངས་མ་ཟོས།
en: As my body withered, I lost my appetite, even for delicious food.

source: །དེ་ཚེ་གླང་པོ་བདག་ཉིད་ཐར་བར་འགྱུར།
en: At that time I, the elephant, became liberated.

source: །བགྲོད་དཀའ་གངས་ཅན་རི་ལ་དྲེད་དབང་གྱུར།
en: “On snowy mountains, difficult to cross, I was king of the bears.

source: །ང་ཡིས་ཞག་བདུན་བར་དུ་བསྲུངས་པའི་མི།
en: Even though the man whom I protected for seven days

source: །དེ་ཡིས་གསོད་པ་ང་ལ་བཏང་བྱས་ཀྱང་།
en: Surrendered me to a hunter,

source: །ངས་ནི་དེ་ཚེ་ཁོང་ཁྲོ་བྱས་པ་མེད།
en: At that time, I did not feel rage.

source: །ཁ་བ་ཀུན་ད་འདྲ་བའི་གླང་པོར་གྱུར།
en: “I was an elephant, as white as snow or jasmine,

source: །བྱང་ཆུབ་མཆོད་རྟེན་སངས་རྒྱས་ཡོན་ཏན་ཚོལ།
en: Intent on supreme enlightenment and seeking the qualities of a buddha.

source: །དུག་དང་བཅས་པའི་མདའ་ཡིས་བསྣུན་ཀྱང་ནི། །མཆེ་བ་དམ་པ་བྱིན་གྱི་ཁྲོས་པ་མེད།
en: Even though I was pierced by a poisonous arrow, I was not enraged upon surrendering my excellent tusks. “When I was immersed in loving kindness

source: །དུམ་བུའི་གླིང་དུ་ནགས་ཚལ་སྤྱོད་ཡུལ་བ། །སྲེག་པའི་ཕྲུག་གུ་བྱམས་ལ་གནས་གྱུར་ཚེ།
en: As a young partridge roaming the woods on Khaṇḍaka Island,

source: །མཐོང་བ་ཙམ་གྱིས་མེ་ནི་ཞི་གྱུར་ནས།
en: A wildfire died out by my merely gazing at it,

source: །ལྷ་ཚོགས་དག་གིས་མེ་ཏོག་རྣམས་ཀྱང་གཏོར།
en: And the host of gods scattered flowers. “When I was a deer, I saved someone

source: །རི་དགས་གྱུར་ཚེ་གང་གཱའི་རླབས་ཤུགས་ཀྱིས།
en: Who was carried away by the waves of the Ganges.

source: །ཁྱེར་བ་ཞིག་ནི་ང་ཡིས་བསྒྲལ་བྱས་པ། །དེ་ཡིས་གསོད་པ་ང་གན་ཁྲིད་དེ་འོངས།
en: That person led a hunter close to me,

source: །འོན་ཀྱང་དེ་ལ་ང་ནི་ཡིད་མ་ཁྲོས།
en: Yet I did not become angry at him. “When I took rebirth as a turtle and rescued five hundred helpless merchants

source: །རྒྱ་མཚོའི་དབུས་སུ་སོན་སྟེ་མགོན་མེད་པ།
en: Who were lost in the middle of the sea,

source: །ཚོང་པ་ལྔ་བརྒྱ་དག་ནི་བསྒྲལ་བྱས་ནས།
en: I practiced loving kindness,

source: །བཀྲེས་པ་དེ་དག་རྣམས་ཀྱིས་བསད་གྱུར་ཚེ། །རུ་སྦལ་སྐྱེ་གནས་གྱུར་ཀྱང་བྱམས་དང་ལྡན།
en: Even though they killed me, driven by hunger.

source: །ང་ནི་བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པ་ན། །སྔོན་ཆད་ཆུ་ན་རྒྱུ་བའི་ཉར་གྱུར་ཚེ།
en: “Formerly, when I was a fish swimming through the water, While training in the conduct of enlightenment,

source: །སེམས་ཅན་ཕན་ཕྱིར་ང་ཡིས་ལུས་བཏང་སྟེ། །སྲོག་ཆགས་བརྒྱ་སྟོང་དག་གིས་ཟོས་པར་གྱུར།
en: I sacrificed my body, which was devoured by one hundred thousand animals, In order to benefit sentient beings.

source: །སྲོག་ཆགས་དེས་པར་གང་ཚེ་གྱུར་པ་ན།
en: “When I was Prāṇakusaumya,

source: །ནད་བརྒྱས་གཟིར་བའི་འགྲོ་བ་མཐོང་ནས་སུ།
en: Seeing the world tormented by a hundred types of illness,

source: །ལུས་ནི་སྨན་ལྟ་བུར་ཡང་བསྒྱུར་བྱས་ཏེ།
en: I transformed my body into medicine

source: །སེམས་ཅན་བདེ་ཞིང་ནད་ཀྱང་མེད་པར་བྱས།
en: And established sentient beings in happiness, healing their diseases.

source: །རི་དགས་རྒྱལ་པོ་སེང་གེར་གྱུར་པའི་ཚེ། །མཐུ་སྟོབས་ལྡན་པར་གྱུར་ཅིང་སྙིང་རྗེར་ལྡན།
en: “When I was a lion, king of wild animals, with strength and compassion,

source: །མདའ་ཡིས་བསྣུན་ཀྱང་ཁྲོས་པའི་སེམས་མེད་དེ།
en: Even though I was pierced by an arrow, I did not become angry.

source: །དེ་ཚེ་གསོད་ལ་ང་ཡིས་བྱམས་པ་བྱས།
en: At that time, I generated loving kindness toward my murderer.

source: །དུང་དང་བ་མོ་ལྟ་བུའི་རྟ་རྒྱལ་དུ།
en: “Formerly, when I was the king of horses, white like conches and frost,

source: །ང་སྔོན་རྒྱ་མཚོའི་ངོགས་སུ་གྱུར་པའི་ཚེ།
en: Living at seaports,

source: །སྲིན་མོའི་ནང་དུ་སོན་པའི་ཚོང་པ་རྣམས།
en: I rescued merchants trapped by demonesses

source: །ང་ཡིས་སྙིང་བརྩེ་སྙིང་རྗེ་བསྐྱེད་ནས་བསྒྲལ།
en: By generating love and compassion.

source: །འགྲོ་བའི་དོན་དུ་བྱང་ཆུབ་སྤྱད་སྤྱོད་ཚེ།
en: “When practicing the conduct of enlightenment for the sake of living beings,

source: །འདབ་ཆགས་ཀུན་ནི་ང་གྱུར་ཚེ།
en: At the time I was a kuṇāla bird.

source: །འདོད་པའི་ཡོན་ཏན་ཉེས་པ་མང་སྤངས་ནས།
en: Having relinquished sensual pleasures and numerous wrongdoings,

source: །བུད་མེད་དབང་དུ་ང་ནི་སོང་མ་གྱུར།
en: I did not fall under the power of females.

source: །གེལ་བའི་ནགས་གནས་རི་བོང་གྱུར་པའི་ཚེ།
en: “When I was a hare, living in a thicket in the woodlands,

source: །ལེགས་སྤྱོད་རི་བོང་ཚོགས་གྱུར་དེ་ལ་བསྟན།
en: I taught good conduct to the assembled hares.

source: །ཐུབ་པ་གནས་ལ་གནས་པ་བཀྲེས་ཕོངས་པ།
en: For the sake of a sage who was living in his hermitage, oppressed by hunger,

source: །དེ་ཡི་ཆེད་དུ་ངས་ནི་ལུས་ཀྱང་བཏང་།
en: I even gave away my body.

source: །སྡོང་པོ་མེ་ཏོག་འབྲས་རྒྱས་ནེ་ཙོའི་ཚེ།
en: “When I was a parrot in a tree full of flowers and fruits,

source: །སྡོང་པོ་སྐམས་ཀྱང་ངས་ནི་དེ་མ་བཏང་།
en: Even though the tree dried up, I did not abandon it.

source: །དེ་ཚེ་བརྒྱ་བྱིན་བྱས་གཟོས་ང་མཐོང་ནས།
en: When Śakra saw my gratitude at that time,

source: །སྡོང་པོ་དེ་ནི་ལོ་འབྲས་རྒྱས་པར་བྱས།
en: He made that tree bountiful again.

source: །ང་ནི་སྤྲ་ཡི་རྒྱལ་པོར་གྱུར་པའི་ཚེ།
en: “When I was the king of the monkeys,

source: །མི་ཡི་རྒྱལ་པོ་ཀླུ་ཡིས་ཡུལ་བཅོམ་སྟེ།
en: The king of the nāgas conquered the country,

source: །སྤྲ་ཡི་ཚོགས་ལ་གནོད་པ་བྱུང་མཐོང་ནས།
en: And having seen a group of monkeys being harmed,

source: །རྒྱལ་པོའི་འཇིགས་ལས་དེ་དག་ངས་བཏོན་ཏོ།
en: I liberated them from their fear of the nāga king.

source: །ང་སྔོན་ནེ་ཙོར་གྱུར་ཏེ་ཕ་མའི་ཕྱིར།
en: “Formerly, when I was a parrot,

source: །སཱ་ལུ་བླངས་ཚེ་མི་ཡིས་བཟུང་ནས་ནི།
en: I was seized by a man when I grabbed rice for my parents.

source: །ནེ་ཙོ་ཅི་ཕྱིར་ང་ཡི་སཱ་ལུ་ལེན།
en: He then asked, ‘Parrot, why do you take my rice?

source: །ལོ་ཏོག་སྨིན་འདི་མ་རུང་བྱར་སེམས་སམ།
en: Don’t you understand that this destroys these ripe crops?’

source: །ནེ་ཙོ་དེས་སྨྲས་བཟང་པོ་གསན་དུ་གསོལ།
en: “The parrot said, ‘Good man! Please listen!

source: །བདག་ནི་རྐུ་བས་ཁྱོད་ཀྱི་འབྲས་མི་ལེན།
en: I did not take your rice out of thievery,

source: །ཕ་མ་རྒན་རྒོན་གཉིས་ནི་གསོ་བའི་ཕྱིར།
en: But to feed my aged parents.

source: །དེ་ལ་སྙིང་རྗེས་བདག་གིས་སཱ་ལུ་བླངས།
en: I took the rice for them, out of compassion.

source: །གང་ཚེ་ཐོག་མས་ས་བོན་འདེབས་པའི་ཚེ། །འགྲོ་བ་ཀུན་ལ་ཆ་ཤས་སྦྱིན་ནོ་ཞེས།
en: ‘In the beginning, when you were sowing the seeds,

source: །དེ་སྐད་ཚིག་སྨྲས་དེ་ནི་བདག་ཐོས་ཏེ།
en: I heard you saying, “I will give a portion of the rice to all living beings.”

source: །དེས་ན་བདག་ནི་རྐུ་བར་གཞར་མི་འགྱུར།
en: Therefore, I am not stealing.’ “ ‘Very well, parrot!

source: །ནེ་ཙོ་ལེགས་སོ་སཱ་ལུ་ཅི་དགར་ཁྱེར།
en: Take the rice as you please!

source: །སྲིད་ཞུ་འདི་ནི་མི་ཡི་ནང་ནའང་དཀོན།
en: Such devotion is rare even among humans.

source: །ཁྱོད་ནི་མི་ཡི་ནང་འདིར་དུད་འགྲོ་ཡིན།
en: It seems you are the human; I am the animal here.

source: །ལེགས་སོ་ཁྱོད་ནི་དུལ་ཞིང་ཡང་དག་བསྡམས།
en: How great that you are so disciplined, peaceful, and well restrained.’

source: །བྱང་ཆུབ་རྡུལ་བྲལ་དམ་པ་ཚོལ་བ་ན།
en: “Searching for immaculate, excellent enlightenment,

source: །སྔོན་ཆད་སྤྱོད་པ་དེ་ལ་སོགས་པ་རྣམས། །སྤྱད་པའི་ཚེ་ན་དཀའ་བ་བརྒྱ་ལ་ཡང་།
en: When I trained in the past, in a hundred ways difficult to navigate

source: །ང་ཡི་ཡིད་ནི་སྐྱོ་བར་གྱུར་པ་མེད།
en: Such as these, My mind was not discouraged.

source: །ནང་གི་དག་གམ་འོན་ཏེ་ཕྱིར་ཡང་རུང་།
en: “Neither within nor without

source: །ང་ཡིས་དངོས་པོ་མ་བཏང་གང་ཡང་མེད།
en: Is there anything that I have not sacrificed.

source: །ཚུལ་ཁྲིམས་བཟོད་དང་དེ་བཞིན་བརྩོན་འགྲུས་དང་། །བསམ་གཏན་ཐབས་དང་ཤེས་རབ་ངས་སྤྱད་དོ།
en: Thus I practiced discipline, patience, effort, Meditative absorption, skillful means, and insight.

source: །ཤ་དང་པགས་པ་དེ་བཞིན་རྐང་དང་ཁྲག །དེ་དག་རང་གི་ལུས་ལས་སྦྱིན་པ་བྱས།
en: “Flesh and skin, as well as marrow and blood— All this I offered from my own body.

source: །བས་མཐའ་དག་དང་ཕུག་ན་རྒྱུ་བའི་ཚེ།
en: When I was roaming remote places and caves,

source: །ངས་ནི་དེ་ཚེ་ལུས་ནི་སྐམས་པར་བྱས།
en: I allowed my body to dry up.

source: །གང་ལ་སྦྱར་ན་རྒྱལ་བར་འགྱུར་བ་ཡི།
en: “The victorious ones taught the path of renunciation,

source: །སྦྱངས་པ་གང་དག་རྒྱལ་བས་བསྟན་མཛད་པ།
en: Which they adhered to themselves.

source: །སྦྱངས་པ་དེ་ལ་རྟག་ཏུ་རབ་བརྩོན་ཏེ།
en: I always exerted myself on this path of renunciation.

source: །སྔོན་སྤྱོད་ཚེ་ན་ང་ནི་རྟག་ཏུ་འཇུག །སྤྱོད་པའི་ཚེ་ན་ང་ཡིས་གང་བསྟེན་པ།
en: In former lives, I always took this path. “Such was the vast extent of firm observance I adhered to at the time when I was practicing.

source: །བརྟུལ་ཞུགས་རྒྱ་ཆེན་དེ་འདྲ་དེ་དག་དང་། །སྤྱོད་པ་འདི་ཐོས་ནས་ནི་དེ་དག་རྣམས།
en: Having heard about this and about my conduct,

source: །ཚིག་གཅིག་ལ་ཡང་འདུན་པར་མི་འགྱུར་རོ།
en: Some monks do not want to hear even a single word of Dharma.

source: །འདི་ཐོས་གྱུར་ནས་དེ་ཡི་ཚེ་ན་ནི།
en: “Upon hearing it,

source: །བསྟན་པ་འདི་ཉིད་ལ་ནི་འཕྱ་བར་འགྱུར།
en: They mock this teaching.

source: །དེ་དག་ཟས་དང་འཁྲིག་པ་ལྷུར་ལེན་ཅིང་།
en: Defeated by food and sex,

source: །རྟག་ཏུ་གཉིད་ནོན་ཁྭ་ལྟར་གཡོ་ངན་འགྱུར།
en: They are constantly overpowered by torpor, and are deceitful like crows.

source: །རྟག་ཏུ་འཕགས་པ་མ་ཡིན་ཆོས་ལ་སྡང་།
en: “Never noble, they are hostile toward the Dharma.

source: །བསྟན་པ་སུན་འབྱིན་བྱེད་ཅིང་ཡོན་ཏན་ཉམས།
en: They disparage the teachings and are devoid of qualities.

source: །ཞི་བའི་ཆོས་ནི་ཐོས་པར་གྱུར་པ་ན།
en: When they hear the peaceful Dharma,

source: །འདི་ནི་རྒྱལ་བས་གསུངས་པ་མིན་ཞེས་ཟེར།
en: They say, ‘This was not spoken by the Victorious One.’

source: །ང་ཡི་སློབ་དཔོན་ཐོས་པ་རྒྱ་མཚོར་གྱུར།
en: “My teacher was an ocean of knowledge.

source: །མང་དུ་ཐོས་པ་སྨྲ་བའི་གཙོ་བོ་ཡིན།
en: He was very learned and the best proponent.

source: །དེ་ཡིས་འདི་ནི་རྣམ་པ་ཇི་ལྟར་ཡང་། །སངས་རྒྱས་བཀའ་མ་ཡིན་ཞེས་དགག་པ་བྱས།
en: He refuted their claim That this is by no means the word of the Buddha.

source: །ཕ་རོལ་ལས་ཀྱང་རྒན་པར་གྱུར་དེ་ཡི།
en: “Moreover, he had an old guru

source: །བླ་མ་དེ་ནི་དཔག་མེད་ཡོན་ཏན་ཆུང་།
en: Of unfathomable qualities.

source: །དེས་ཀྱང་འདི་ནི་བླང་བ་མ་བྱས་ཀྱི།
en: That person also exclaimed, ‘Don’t adopt this!

source: །འདི་ལ་མ་འཇུག་འདི་ནི་ནོར་བ་ཡིན།
en: Do not engage with it! This is wrong!’ “Some say, ‘Where it is taught that a self does not exist,

source: །གང་ལ་བདག་ཡོད་མ་ཡིན་སྲོག་མེད་དང་། །རྣམ་པ་ཅིས་ཀྱང་གང་ཟག་མེད་བསྟན་པ།
en: That there is no life force, and no person of any kind at all,
